{
  "text": "US could collect $300 billion in tariff revenue this year, Treasury chief says Andrea Shalal and David Lawder Tue, July 8, 2025 at 7:35 PM EDT 2 min read 93 In This Article: ALI=F +0.50% HG=F -1.46% By Andrea Shalal and David Lawder WASHINGTON (Reuters) -Treasury Secretary Scott Bessent on Tuesday said the U.S. has taken in about $100 billion in tariff income so far this year, and this could grow to $300 billion by the end of 2025 as collections accelerate from President Donald Trump's trade campaign. Bessent, speaking to a White House cabinet meeting, said the major collections from Trump's new tariffs only started during the second quarter, when Trump implemented a near universal 10% duty on U.S. imports and boosted duties on steel, aluminum and autos. \"So we could expect that that could be well over $300 billion by the end of the year,\" Bessent said. A Treasury spokesperson said the $300 billion target corresponds to the December 31 end of calendar 2025, not the end of the government's fiscal year on September 30. Reaching $300 billion in tariff collections this year would imply an exponential increase in collections in coming months and steep and broad tariff increases from current levels. Bessent added that the Congressional Budget Office has estimated tariff income will total about $2.8 trillion over 10 years, \"which we think is probably low.\" The Treasury reported record gross customs duties of $22.8 billion in May, a nearly fourfold increase from the $6.2 billion total a year earlier. That brought customs duty collections for the first eight months of fiscal 2025 to $86.1 billion. Collections for the first five months of calendar 2025 totaled $63.4 billion. The Treasury is due to report June budget results on Friday, which are expected to show another substantial increase in tariff collections. As of June 30, combined customs and excise tax collections topped $122 billion for the fiscal year to date, according to the Daily Treasury Statement of accounts. Trump has set a new August 1 deadline for higher \"reciprocal\" tariff rates set to kick in on nearly all trading partners, with room for negotiations with some countries in the next three weeks for deals to bring them lower. \"The big money will start coming in on August 1. I think it was made clear today by the letters that were sent out yesterday and today,\" Trump said. Trump also announced during the same cabinet meeting that he would impose a 50% tariff on copper imports, a metal used in everything from housing to consumer electronics, vehicles, the power grid and military hardware. He also said further tariffs were coming on semiconductors and pharmaceuticals. (Reporting by Andrea Shalal and David Lawder; writing by David Lawder and Bhargav Acharya; editing by Susan Heavey and Sonali Paul) View Comments (93) Terms and Privacy Policy Privacy Dashboard More Info Recommended Stories",
  "predicted_sentiment": "LABEL_2",
  "predicted_confidence": 0.9323040246963501,
  "user_feedback": "accurate",
  "timestamp": "2025-07-09T02:04:11.256Z",
  "page_url": "chrome-extension://faeijdkjlfjmmnjfifnjiceefjjahnic/popup.html",
  "model_version": "1.0"
}